Documents/УЧ_Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УЧ_Инвентаризация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИнвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдДокументаТСД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазбиватьНаИнгредиенты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйСкладДляИсправлений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрошлаяИнвНедостача</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрошлаяИнвПодснятие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПрошлаяИнвПодснятие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРеализация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтклонениеБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтклонениеБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Готово</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолуфабрикатыИГП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДТЧ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УЧ_Инвентаризация/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РеквизитыДокумента = БюджетныйНаСервере.ВернутьРеквизиты(Данные.Ссылка, "ВидОперации");
	Если НЕ РеквизитыДокумента = Неопределено И ЗначениеЗаполнено(РеквизитыДокумента.ВидОперации) Тогда
		Представление = Строка(РеквизитыДокумента.ВидОперации) + " " + Строка(Данные.Номер) + " от " + Строка(Данные.Дата);	
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка, ВедомостьДляЗаполнения = Ложь) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УЧ_Инвентаризация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
		#Область ИсходныйКод
	//Запрос.Текст = "ВЫБРАТЬ
	//|	УЧ_Инвентаризация.Дата КАК Дата,
	//|	УЧ_Инвентаризация.Номер КАК Номер,
	//|	УЧ_Инвентаризация.Организация КАК Организация,
	//|	УЧ_Инвентаризация.Предприятие КАК Предприятие,
	//|	УЧ_Инвентаризация.Склад КАК Склад,
	//|	УЧ_Инвентаризация.Товары.(
	//|		НомерСтроки КАК НомерСтроки,
	//|		Номенклатура КАК Номенклатура,
	//|		КоличествоФакт КАК КоличествоФакт,
	//|		СуммаФакт КАК СуммаФакт,
	//|		Количество КАК Количество,
	//|		Сумма КАК Сумма,
	//|		КоличествоОтклонение КАК КоличествоОтклонение,
	//|		СуммаОтклонение КАК СуммаОтклонение,
	//|		КоличествоБУ КАК КоличествоБУ,
	//|		СуммаБУ КАК СуммаБУ,
	//|		КоличествоОтклонениеБУ КАК КоличествоОтклонениеБУ,
	//|		СуммаОтклонениеБУ КАК СуммаОтклонениеБУ,
	//|		СерияНоменклатуры КАК СерияНоменклатуры,
	//|		СчетУчета КАК СчетУчета
	//|	) КАК Товары
	//|ИЗ
	//|	Документ.УЧ_Инвентаризация КАК УЧ_Инвентаризация
	//|ГДЕ
	//|	УЧ_Инвентаризация.Ссылка В(&Ссылка)"; 
	//Запрос.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	//ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	//ТабДок.Очистить();

	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;

	//	ТабДок.Вывести(ОбластьЗаголовок);

	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());

	//	ТабДок.Вывести(ОбластьТоварыШапка);
	//	ВыборкаТовары = Выборка.Товары.Выбрать();
	//	Пока ВыборкаТовары.Следующий() Цикл
	//		ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
	//		ОбластьТовары.Область(1,2,1,ТабДок.ШиринаТаблицы).ЦветФона = Новый Цвет(0, 255, 0);
	//		ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень()); 
	//	КонецЦикла;
	#КонецОбласти
	Если ВедомостьДляЗаполнения Тогда
	Запрос.Текст = "ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(УЧ_ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВТТоварыГрупп
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка,
	|	УЧ_ИнвентаризацияТовары.Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Дата КАК Дата,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Номер КАК Номер,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Организация КАК Организация,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Предприятие КАК Предприятие,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Склад КАК Склад,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.Количество КАК Количество,
	|	УЧ_ИнвентаризацияТовары.Сумма КАК Сумма,
	|	УЧ_ИнвентаризацияТовары.КоличествоБУ КАК КоличествоБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаБУ КАК СуммаБУ,
	|	УЧ_ИнвентаризацияТовары.КоличествоОтклонениеБУ КАК КоличествоОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаОтклонениеБУ КАК СуммаОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	УЧ_ИнвентаризацияТовары.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ВТТоварыГрупп.НомерСтроки > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РазделениеПоСчетамДляВыделенияСтроки
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыГрупп КАК ВТТоварыГрупп
	|		ПО УЧ_ИнвентаризацияТовары.Ссылка = ВТТоварыГрупп.Ссылка
	|			И УЧ_ИнвентаризацияТовары.Номенклатура = ВТТоварыГрупп.Номенклатура
	|			И УЧ_ИнвентаризацияТовары.СерияНоменклатуры = ВТТоварыГрупп.СерияНоменклатуры
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.МоментВремени,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Предприятие),
	|	МАКСИМУМ(Склад)
	|ПО
	|	Ссылка";

	Иначе
	Запрос.Текст = "ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(УЧ_ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВТТоварыГрупп
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка,
	|	УЧ_ИнвентаризацияТовары.Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Дата КАК Дата,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Номер КАК Номер,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Организация КАК Организация,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Предприятие КАК Предприятие,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Склад КАК Склад,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.КоличествоФакт КАК КоличествоФакт,
	|	УЧ_ИнвентаризацияТовары.СуммаФакт КАК СуммаФакт,
	|	УЧ_ИнвентаризацияТовары.Количество КАК Количество,
	|	УЧ_ИнвентаризацияТовары.Сумма КАК Сумма,
	|	УЧ_ИнвентаризацияТовары.КоличествоОтклонение КАК КоличествоОтклонение,
	|	УЧ_ИнвентаризацияТовары.СуммаОтклонение КАК СуммаОтклонение,
	|	УЧ_ИнвентаризацияТовары.КоличествоБУ КАК КоличествоБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаБУ КАК СуммаБУ,
	|	УЧ_ИнвентаризацияТовары.КоличествоОтклонениеБУ КАК КоличествоОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаОтклонениеБУ КАК СуммаОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	УЧ_ИнвентаризацияТовары.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ВТТоварыГрупп.НомерСтроки > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РазделениеПоСчетамДляВыделенияСтроки
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыГрупп КАК ВТТоварыГрупп
	|		ПО УЧ_ИнвентаризацияТовары.Ссылка = ВТТоварыГрупп.Ссылка
	|			И УЧ_ИнвентаризацияТовары.Номенклатура = ВТТоварыГрупп.Номенклатура
	|			И УЧ_ИнвентаризацияТовары.СерияНоменклатуры = ВТТоварыГрупп.СерияНоменклатуры
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.МоментВремени,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Предприятие),
	|	МАКСИМУМ(Склад)
	|ПО
	|	Ссылка";
    КонецЕсли;
	Запрос.Параметры.Вставить("Ссылка", Ссылка); 
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			Если ВыборкаТовары.РазделениеПоСчетамДляВыделенияСтроки Тогда
				ОбластьТовары.Область(1,2,1,ТабДок.ШиринаТаблицы).ЦветФона = Новый Цвет(192, 220, 192); 
			КонецЕсли;
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень()); 
			ОбластьТовары.Область(1,2,1,ТабДок.ШиринаТаблицы).ЦветФона = Новый Цвет(255, 255, 255);
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
